In [37]:
import pandas as pd

In [39]:
df = pd.read_csv('student.csv')

In [40]:
df

   Unnamed: 0  roll    name class  marks  age
0           0     1    anil    TE  56.77   22
1           1     2    amit    TE  59.77   21
2           2     3  aniket    BE  76.88   19
3           3     4  aniket    TE  69.66   20
4           4     5    asha    TE  63.28   20
5           5     6   ayesh    BE  49.55   20
6           6     7    asha    BE  65.34   19
7           7     8   amita    BE  68.33   23
8           8     9    amol    TE  56.75   20
9           9    10   anmol    BE  78.66   21

In [47]:
df.drop('Unnamed: 0',axis=1,inplace=True)

In [48]:
df

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19
3     4  aniket    TE  69.66   20
4     5    asha    TE  63.28   20
5     6   ayesh    BE  49.55   20
6     7    asha    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [49]:
df.mean()

C:\Users\mayur\AppData\Local\Temp\ipykernel_11780\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

roll      5.500
marks    64.499
age      20.500
dtype: float64

In [50]:
df.median()

C:\Users\mayur\AppData\Local\Temp\ipykernel_11780\530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

roll      5.50
marks    64.31
age      20.00
dtype: float64

In [51]:
df.std()

C:\Users\mayur\AppData\Local\Temp\ipykernel_11780\3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

roll     3.027650
marks    9.207179
age      1.269296
dtype: float64

In [52]:
df.min()

roll         1
name      amit
class       BE
marks    49.55
age         19
dtype: object

In [53]:
df.max()

roll        10
name     ayesh
class       TE
marks    78.66
age         23
dtype: object

In [54]:
import numpy as np

In [57]:
np.std(df['marks'])

8.734696846485285

In [66]:
df.head()

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19
3     4  aniket    TE  69.66   20
4     5    asha    TE  63.28   20

In [74]:
gr1 = df.groupby('class')

In [75]:
for key,value in gr1:
    print(key)
    print(value)

BE
   roll    name class  marks  age
2     3  aniket    BE  76.88   19
5     6   ayesh    BE  49.55   20
6     7    asha    BE  65.34   19
7     8   amita    BE  68.33   23
9    10   anmol    BE  78.66   21
TE
   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
3     4  aniket    TE  69.66   20
4     5    asha    TE  63.28   20
8     9    amol    TE  56.75   20

In [77]:
te = gr1.get_group('TE')

In [81]:
te.min()

roll         1
name      amit
class       TE
marks    56.75
age         20
dtype: object

In [82]:
te.max()

roll         9
name      asha
class       TE
marks    69.66
age         22
dtype: object

In [83]:
gr2 = df.groupby('age')

In [84]:
gr2.groups

{19: [2, 6], 20: [3, 4, 5, 8], 21: [1, 9], 22: [0], 23: [7]}

In [85]:
tw = gr2.get_group(20)

In [86]:
tw

   roll    name class  marks  age
3     4  aniket    TE  69.66   20
4     5    asha    TE  63.28   20
5     6   ayesh    BE  49.55   20
8     9    amol    TE  56.75   20

In [87]:
import seaborn as sns

In [88]:
df = sns.load_dataset('iris')

In [91]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [93]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [94]:
gr = df.groupby('species')

In [96]:
gr.groups

{'setosa': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49], 'versicolor': [50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99], 'virginica': [100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149]}

In [97]:
se = gr.get_group('setosa')
ve = gr.get_group('versicolor')
vi = gr.get_group('virginica')

In [99]:
se.shape

(50, 5)

In [100]:
ve.shape

(50, 5)

In [101]:
vi.shape

(50, 5)

In [102]:
se.describe()

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000    50.000000
mean        5.00600     3.428000      1.462000     0.246000
std         0.35249     0.379064      0.173664     0.105386
min         4.30000     2.300000      1.000000     0.100000
25%         4.80000     3.200000      1.400000     0.200000
50%         5.00000     3.400000      1.500000     0.200000
75%         5.20000     3.675000      1.575000     0.300000
max         5.80000     4.400000      1.900000     0.600000

In [103]:
ve.describe()

       sepal_length  sepal_width  petal_length  petal_width
count     50.000000    50.000000     50.000000    50.000000
mean       5.936000     2.770000      4.260000     1.326000
std        0.516171     0.313798      0.469911     0.197753
min        4.900000     2.000000      3.000000     1.000000
25%        5.600000     2.525000      4.000000     1.200000
50%        5.900000     2.800000      4.350000     1.300000
75%        6.300000     3.000000      4.600000     1.500000
max        7.000000     3.400000      5.100000     1.800000

In [104]:
vi.describe()

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        6.58800     2.974000      5.552000      2.02600
std         0.63588     0.322497      0.551895      0.27465
min         4.90000     2.200000      4.500000      1.40000
25%         6.22500     2.800000      5.100000      1.80000
50%         6.50000     3.000000      5.550000      2.00000
75%         6.90000     3.175000      5.875000      2.30000
max         7.90000     3.800000      6.900000      2.50000

In [106]:
print("Hello")

Hello